sst311212/stm32_soldering_iron_controller/Core/Src/settings.c
  uint32_t _irq = __get_PRIMASK();
  __disable_irq();
  configurePWMpin(output_Low);

  HAL_FLASH_Unlock();
  __set_PRIMASK(_irq);

  erase.NbPages     = numPages;
  erase.PageAddress = pageAddress;
  erase.TypeErase   = FLASH_TYPEERASE_PAGES;

  HAL_IWDG_Refresh(&hiwdg);
  if((HAL_FLASHEx_Erase(&erase, &error)!=HAL_OK) || (error!=0xFFFFFFFF)){
     Error_Handler();
  }
  HAL_FLASH_Lock();

  // Ensure flash was erased
  for (uint32_t i = 0u; i < (numPages * flashPageSize / sizeof(int32_t)); i++) {
    if( *((uint32_t*)pageAddress+i) != 0xFFFFFFFF){
      Error_Handler();
    }
  }
}

static void writeFlash(uint32_t* src, uint32_t len, uint32_t dstAddr)
{
  uint32_t numWordsToWrite = (len + sizeof(uint32_t) - 1u) / sizeof(uint32_t);
  uint32_t* srcData = src;

  uint32_t _irq = __get_PRIMASK();
  __disable_irq();
  HAL_FLASH_Unlock();
  __set_PRIMASK(_irq);

  // written = number of 32-bit values written
  for(uint32_t written=0; written < numWordsToWrite; written++){
    if(HAL_FLASH_Program(FLASH_TYPEPROGRAM_WORD, dstAddr, *srcData ) != HAL_OK)
    {
       Error_Handler();
    }
    dstAddr += sizeof(uint32_t); // increase pointers
    srcData++;
  }
  HAL_FLASH_Lock();
}

static void resetflashTipData(flashTipData_t *tipData, uint8_t profile){
  tipData->tip[0] = defaultTipData[profile];                                               // Load default tip
  strcpy(tipData->tip[0].name, defaultTipName[profile]);                                   // Load default tip name
  tipData->currentNumberOfTips = 1;                                                        // Set current tips to 1
  tipData->version = TIP_SETTINGS_VERSION;

  for (int i = 0; backup_tips.tipNums <= 63 && i < backup_tips.tipNums; i++) {
    backup_data_t* blk = &backup_tips.tipData[i];
    if (blk->profile <= profile_C210 && blk->profile == profile) {
      int x = tipData->currentNumberOfTips++;
      memcpy(tipData->tip[x].name, blk->tipname, strlen(blk->tipname));
      tipData->tip[x].calADC_At_250 = blk->cal_250;
      tipData->tip[x].calADC_At_400 = blk->cal_400;
    }
  }
}

void saveTip(uint8_t save_mode, uint8_t tip_index){
  #ifndef DEBUG
  struct mallinfo mi = mallinfo();
  #endif
  if(mi.uordblks > 128)                   // Check that heap usage is low
     Error_Handler();                      // We got there from a working screen (Heap must be free)

  uint8_t profile = getCurrentProfile();
  flashTipSlot_t* flashBufferTipBlock = _malloc(sizeof(flashTipSlot_t));

  if(flashBufferTipBlock == NULL)
    Error_Handler();

  for(uint8_t i=0; i<NUM_PROFILES; i++){
    if( ((save_mode == reset_tips) && (i == profile)) || (save_mode == reset_allTips) ||                          // Reset current tip slot, reset all tips
        (ChecksumTipData(&flashTips[i].data) != flashTips[i].crc)){ // Perform check in others and reset if wrong
      resetflashTipData(&flashBufferTipBlock->data, i);
      flashBufferTipBlock->crc = ChecksumTipData(&flashBufferTipBlock->data);
      eraseFlashPages((uint32_t)&flashTips[i], flashPages_TipSlot);
      writeFlash((uint32_t*)flashBufferTipBlock, sizeof(flashTipSlot_t), (uint32_t)&flashTips[i]);
    }
  }

  if(save_mode == perform_scanFix || save_mode == reset_tips || save_mode == reset_allTips){
    _free(flashBufferTipBlock);
    return;
  }

  if((profile>profile_C210) || (getProfileSettings()->ID != profile ))                                        // Sanity check
      Error_Handler();

  if( ChecksumTipData(&flashTips[profile].data) != flashTips[profile].crc){
    if(flashBufferTipBlock == NULL)
      Error_Handler();
  }
  flashBufferTipBlock->data = flashTips[profile].data;                                                       // Backup flash tips
  if(save_mode == save_tip){
    flashBufferTipBlock->data.tip[tip_index] =  *getCurrentTipData();                                       // Save current tip
  }
  else if(save_mode == add_tip){
    flashBufferTipBlock->data.tip[flashBufferTipBlock->data.currentNumberOfTips++] =  *getCurrentTipData();     // Add new tip, increase count
  }
  else if(save_mode == delete_tip){                                                               // Delete tip
    for(uint8_t i=tip_index; i<getCurrentNumberOfTips()-1; i++)                      // Overwrite selected tip with the next one, move the rest one position backwards
      flashBufferTipBlock->data.tip[i] = flashBufferTipBlock->data.tip[i+1];

    flashBufferTipBlock->data.currentNumberOfTips--;                                                               // Move one position back if possible
    setCurrentTip(tip_index-1);
  }
  else
    Error_Handler();                                                                                  // Save mode = Save_Tip, but tip_modenot defined, something went wrong}

  sortTips(&flashBufferTipBlock->data, flashBufferTipBlock->data.currentNumberOfTips);                                                                         // Sort tips

  flashBufferTipBlock->crc = ChecksumTipData(&flashBufferTipBlock->data);

  eraseFlashPages((uint32_t)&flashTips[profile], flashPages_TipSlot);
  writeFlash((uint32_t*)flashBufferTipBlock, sizeof(flashTipSlot_t), (uint32_t)&flashTips[profile]);

  uint32_t flashChecksum, ramChecksum;

  // Check flash and profile have same checksum
  ramChecksum   = ChecksumTipData(&flashBufferTipBlock->data);
  flashChecksum = ChecksumTipData(&flashTips[profile].data);
  if( (flashChecksum != ramChecksum) ||
     (flashChecksum != flashTips[profile].crc)){
    Error_Handler();
  }
  _free(flashBufferTipBlock);
  loadTipDataFromFlash(getCurrentTip());                                                                // Reload tip, sortTips will have updated the number to keep the same tip, or the new one
}

static void sortTips(flashTipData_t * data, uint8_t numberOfTips){
  uint8_t min;
  char current[TIP_LEN+1];
  tipData_t backupTip;
  strcpy (current, getCurrentTipData()->name);                                                    // Copy tip name being used in the system
  for(uint8_t j=0; j<numberOfTips; j++){                            // Sort alphabetically
    min = j;                                                                                      // Min is start position
    for(uint8_t i=j+1; i<numberOfTips; i++){
      if(strcmp(data->tip[min].name, data->tip[i].name) > 0)                                      // If Tip[Min] > Tip[i]
        min = i;                                                                                  // Update min
    }
    if(min!=j){                                                                                   // If j is not the min
      backupTip = data->tip[j];                                                                   // Swap j and min
      data->tip[j] = data->tip[min];
      data->tip[min] = backupTip;
    }
  }
  setCurrentTip(0);                                                                               // Just in case it's not found
  for(uint8_t i=0; i<numberOfTips; i++){                            // Find the same tip after sorting
    if(strcmp(current, data->tip[i].name) == 0){                                                  // If matching name
      setCurrentTip(i);                                                                           // Update the tip to be reloaded later
      break;
    }
  }
}

void saveSettings(uint8_t save_mode, uint8_t reboot_mode){
  if(reboot_mode  == do_reboot)                                        // Force safe save_mode (disable iron power) if rebooting.
    setSafeMode(enable);



  uint8_t needs_saving = save_mode;
  uint32_t _irq = __get_PRIMASK();

  if( ((save_mode & save_settings) && (save_mode & reset_settings)) ||        // Sanity check
      ((save_mode & save_profile) && (save_mode & reset_profile))   ||
      ((save_mode & save_profile) && (save_mode & reset_profiles))  ||
      ((save_mode & save_addons) && (save_mode & reset_addons))     ){

    Error_Handler();
  }

  uint8_t profile = getCurrentProfile();

  if((profile>profile_C210) || (getProfileSettings()->ID != profile ))                                   // Sanity check
      Error_Handler();

  if(save_mode == reset_all)
    saveTip(reset_allTips, 0);

  flashSettings_t* flashBufferSettings = _malloc(sizeof(flashSettings_t));


  // check if malloc succeeded or not
  if(flashBufferSettings == NULL)
    Error_Handler();

