sst311212/stm32_soldering_iron_controller/Core/Src/settings.c
  flashPages_GlobalSettings = (sizeof(flashSettings_t) + flashPageSize - 1) / flashPageSize;
  flashPages_TempSettings   = (sizeof(temp_settings_t) + flashPageSize - 1) / flashPageSize;
  flashPages_TipSlot       = (sizeof(flashTipSlot_t) + flashPageSize - 1) / flashPageSize;
#endif

  if(setup){                                                                                              // Setup mode, so flash data is not initialized
    getSettings()->setupMode = enable;                                                                    // Load setup state for boot screen
    setSafeMode(enable);                                                                                  // Safe mode just in case
    resetSystemSettings(getSystemSettings());                                                             // Load default system settings
#ifdef ENABLE_ADDONS
    resetAddonSettings(getAddons());                                                                      // Load default addon settings
#endif
    resetProfileSettings(getProfileSettings(), profile_T12);                                              // Load default profile settings
    flashTempSettingsInit();                                                                              // Always init this to set default/safe values at boot. Initializes flashTemp index
    loadSettingsFromBackupRam();                                                                          // Also read backup ram. loadProfile wil take the correct values depending on hasBattery variable.
    setCurrentProfile(profile_T12);                                                                       // Force profile T12, we can't call loadProfile, there's nothing in flash, let boot screen finish it
  }
  else{
    Button_reset();
                                                                                                          //                           [ CHECK SYSTEM SETTINGS ]
    if( (flashGlobalSettings.system.version==SYSTEM_SETTINGS_VERSION) &&                                        // System version correct
        (flashGlobalSettings.systemChecksum != ChecksumSystemSettings(&flashGlobalSettings.system))){                 // But bad cheksum
      checksumError(reset_settings);                                                                      // Show checksum error
    }
                                                                                                          //                           [ CHECK PROFILE SETTINGS ]
    for(uint8_t i=0;i<NUM_PROFILES;i++){
      if( (flashGlobalSettings.profile[i].version==PROFILE_SETTINGS_VERSION) &&                                 // Profile version correct
          (flashGlobalSettings.profileChecksum[i] != ChecksumProfileSettings(&flashGlobalSettings.profile[i])) ){     // But bad cheksum
        checksumError(reset_profile);                                                                     // Show checksum error
        break;
      }
    }
                                                                                                          //                           [ CHECK TIPS ]
    for(uint8_t i=0;i<NUM_PROFILES;i++){
      if( (flashTips[i].data.version==TIP_SETTINGS_VERSION) &&                                            // Tips version correct
          (flashTips[i].crc != ChecksumTipData(&flashTips[i].data)) ){                                    // But bad cheksum
        checksumError(reset_tips);                                                                        // Show checksum error
        break;
      }
    }

#ifdef ENABLE_ADDONS                                                                                          //                           [ CHECK ADDONS SETTINGS ]
    if( (flashGlobalSettings.addons.enabledAddons!=0xFFFFFFFFFFFFFFFFU) &&                                      // Not filled with 0xFF (Otherwise flash is erased)
        (flashGlobalSettings.addonsChecksum != ChecksumAddons(&flashGlobalSettings.addons))){                         // But bad cheksum
      checksumError(reset_addons);                                                                        // Show checksum error
    }
#endif
    saveSettings(perform_scanFix, no_reboot);                                                             // Scan current settings, reset any bad area
    saveTip(perform_scanFix, 0);

    flashTempSettingsInit();                                                                              // These initialize currentProfile, needed later by loadProfile
    loadSettingsFromBackupRam();
    loadProfile(getCurrentProfile());                                                                     // Will restore lastTemp and lastTip from the correct source (Flash or backup SRAM).

#ifdef ENABLE_ADDONS
    *getAddons() = flashGlobalSettings.addons;                                                                  // Load current addons
#endif
    *getSystemSettings() = flashGlobalSettings.system;                                                          // Load current settings
  }
}

void loadSettingsFromBackupRam(void) {
  if(getSystemSettings()->hasBattery == 0)
    return;

  // assert on backup ram size
  if(sizeof(bkpRamData.values) + sizeof(uint32_t) > BACKUP_RAM_SIZE_IN_BYTES)
  {
    Error_Handler(); // can't put this much data into the backup ram
  }

  readBackupRam();
  // check crc
  if(bkpRamData.crc != ChecksumBackupRam() || bkpRamData.values.lastProfile > profile_C210  )
  {
    // restore defaults, show error
    memset((void*)&bkpRamData,0, sizeof(backupRamData_t));
    for(uint8_t i = 0; i < NUM_PROFILES; i++)
    {
      bkpRamData.values.lastTipTemp[i] = 0;               // To be resetted by loadProfile on loading
      if(bkpRamData.values.lastTipTemp[i] == UINT16_MAX) // just a sanity check to handle uninitialized data
      {
        bkpRamData.values.lastTipTemp[i] = 0u;
      }
      bkpRamData.values.lastSelTip[i] = 0u;
    }
    bkpRamData.values.lastProfile = profile_T12;
    writeBackupRam();

    bkpRamData.values.lastProfile = getCurrentProfile();
    bkpRamData.values.lastTipTemp[getCurrentProfile()] = flashTemp.temp;
    bkpRamData.values.lastSelTip[getCurrentProfile()] = flashTemp.tip[getCurrentProfile()];
    // Oled_error_init();
    // putStrAligned("New/low batt?", 0, align_center);
    // putStrAligned("Forgot last", 16, align_center);
    // putStrAligned("used settings.", 32, align_center);
    // putStrAligned("Restored dflt.", 48, align_left);
    // update_display();
    // ErrCountDown(3,117,50);
  }
  setCurrentProfile(bkpRamData.values.lastProfile);
}


