sst311212/stm32_soldering_iron_controller/Core/Src/settings.c
static void readBackupRam()
{
#ifndef STM32F072xB
  for(uint8_t i = 0; i < NUM_BACKUP_RAM_REGISTERS; i++)                                   // STM32F10x has 16.bit backup registers
  {
    uint16_t data = (uint16_t)*(&(BKP->DR1) + i);
    bkpRamData.bytes[i*2  ] = data;
    bkpRamData.bytes[i*2+1] = data >> 8u;
  }
#else
  memcpy(bkpRamData.bytes, (uint8_t*)&RTC->BKP0R, BACKUP_RAM_SIZE_IN_BYTES);              // STM32F072 has 32bit backup registers
#endif
}

static void writeBackupRam()
{
  bkpRamData.crc = ChecksumBackupRam();
#ifndef STM32F072xB
  for(uint8_t i = 0; i < NUM_BACKUP_RAM_REGISTERS; i++)
  {
    *(&(BKP->DR1) + i) = bkpRamData.bytes[i*2] + ((uint32_t)bkpRamData.bytes[i*2+1] << 8u);
  }
#else
  memcpy((uint8_t*)&RTC->BKP0R, bkpRamData.bytes, BACKUP_RAM_SIZE_IN_BYTES);
#endif
}

static uint32_t ChecksumBackupRam(){
  uint32_t checksum;
  checksum = HAL_CRC_Calculate(&hcrc, (uint32_t*)bkpRamData.bytes, sizeof(bkpRamData.values)/sizeof(uint32_t) );
  return checksum;
}

void flashTempSettingsInitialSetup(void){                                     // To be called after initial setup screen
  flashTempSettingsErase();
  for(uint8_t i=0;i<NUM_PROFILES;i++)
    flashTemp.tip[i]= 0;

  flashTemp.temp = defaultProfileSettings.defaultTemperature;
  flashTemp.profile=profile_T12;
  flashTempWrite();
  flashTipsWrite();
  flashProfileWrite();

  setCurrentProfile(profile_T12);                                // Just in case
  setCurrentTip(0);
  setUserTemperature( defaultProfileSettings.defaultTemperature);
}

void flashTempSettingsInit(void) //call it only once during init
{
  bool setDefault=0;
  uint16_t i;

  for(i=0; i<(sizeof(flashTempSettings.temperature)/2)-1 && flashTempSettings.temperature[i+1] != UINT16_MAX; i++);   // Seek through the array

  if(i<(sizeof(flashTempSettings.temperature)/2)-1){                                                              // Free slot found
    for(uint16_t j=i+1; j<(sizeof(flashTempSettings.temperature)/2)-1; j++) {                                     // Ensure rest of array is erased
      if(flashTempSettings.temperature[j] != UINT16_MAX){                                                         // Found unexpected data
        setDefault=1;                                                                                         // Reset
        break;
      }
    }
    if(!setDefault){
      flashTemp.tempIndex = i;
      flashTemp.temp = flashTempSettings.temperature[i];
    }
  }                                                                                                           // No free slot found, reset
  else
    setDefault=1;

  if(!setDefault){
    for(i=0; i<(sizeof(flashTempSettings.profile)/2)-1 && flashTempSettings.profile[i+1] != UINT16_MAX; i++);         // Same operation with profile
    if(i<(sizeof(flashTempSettings.profile)/2)-1){
      for(uint16_t j=i+1; j<(sizeof(flashTempSettings.profile)/2)-1; j++) {
        if(flashTempSettings.profile[j] != UINT16_MAX){
          setDefault=1;
          break;
        }
      }
      if(!setDefault){
        flashTemp.profile=flashTempSettings.profile[i];
        flashTemp.profileIndex = i;
      }
    }
    else
      setDefault=1;
  }

  if(!setDefault){
    for(uint8_t n=0; n<NUM_PROFILES; n++){
      for(i=0; i<(sizeof(flashTempSettings.tip[0])/2)-1 && flashTempSettings.tip[n][i+1] != UINT16_MAX; i++);         // Same operation with tips
      if(i<(sizeof(flashTempSettings.tip[0])/2)-1){
        for(uint16_t j=i+1; j<(sizeof(flashTempSettings.tip[0])/2)-1; j++) {
          if(flashTempSettings.tip[n][j] != UINT16_MAX){
            setDefault=1;
            break;
          }
        }
        if(!setDefault){
          flashTemp.tipIndex[n] = i;
          flashTemp.tip[n] = flashTempSettings.tip[n][i];
        }
      }
      else
        setDefault=1;
    }
  }

  if(setDefault)
    flashTempSettingsInitialSetup();

  else{
    setCurrentProfile(flashTemp.profile);
    if(flashTempSettings.temperature[flashTemp.tempIndex] != UINT16_MAX)
      flashTemp.tempIndex++;                                             // Increase index if current slot is not empty (Only required when flash is completely erased)

    if(flashTempSettings.profile[flashTemp.profileIndex] != UINT16_MAX)
      flashTemp.profileIndex++;

    for(uint8_t n=0; n<NUM_PROFILES; n++)
      if(flashTempSettings.tip[n][flashTemp.tipIndex[n]] != UINT16_MAX)
        flashTemp.tipIndex[n]++;
  }
}

void flashTempWrite(void)
{
  if(flashTemp.tempIndex>=(sizeof(flashTempSettings.temperature)/2)-1)                // All positions used
  {
    flashTempSettingsErase();
    flashTipsWrite();
    flashProfileWrite();
  }
  HAL_IWDG_Refresh(&hiwdg);
  uint32_t _irq = __get_PRIMASK();
  __disable_irq();
  HAL_FLASH_Unlock();
  __set_PRIMASK(_irq);
  if(HAL_FLASH_Program(FLASH_TYPEPROGRAM_HALFWORD, (uint32_t)&flashTempSettings.temperature[flashTemp.tempIndex], flashTemp.temp) != HAL_OK) {    // Store new temp
     Error_Handler();
  }
  HAL_FLASH_Lock();
  flashTemp.tempIndex++;                                                                                                         // Increase index for next time
}

void flashProfileWrite(void)
{
  if(flashTemp.profileIndex>=(sizeof(flashTempSettings.profile)/2)-1)                // All positions used
  {
    flashTempSettingsErase();
    flashTipsWrite();
    flashTempWrite();
  }

  HAL_IWDG_Refresh(&hiwdg);
  uint32_t _irq = __get_PRIMASK();
  __disable_irq();
  HAL_FLASH_Unlock();
  __set_PRIMASK(_irq);
  if(HAL_FLASH_Program(FLASH_TYPEPROGRAM_HALFWORD, (uint32_t)&flashTempSettings.profile[flashTemp.profileIndex], flashTemp.profile) != HAL_OK) {        // Store new tip/profile data
     Error_Handler();
  }
  HAL_FLASH_Lock();
  flashTemp.profileIndex++;                                                                                                         // Increase index for next time
}

void flashTipsWrite(void)
{
  uint8_t p = getCurrentProfile();
  if(flashTemp.tipIndex[p]>=(sizeof(flashTempSettings.tip[0])/2)-1)                // All positions used
  {
    flashTempSettingsErase();
    flashTempWrite();
    flashProfileWrite();
  }
  HAL_IWDG_Refresh(&hiwdg);
  uint32_t _irq = __get_PRIMASK();
  __disable_irq();
  HAL_FLASH_Unlock();
  __set_PRIMASK(_irq);
  if(HAL_FLASH_Program(FLASH_TYPEPROGRAM_HALFWORD, (uint32_t)&flashTempSettings.tip[p][flashTemp.tipIndex[p]], flashTemp.tip[p]) != HAL_OK) {        // Store new tip/profile data
     Error_Handler();
  }
  HAL_FLASH_Lock();
  flashTemp.tipIndex[p]++;                                                                                                         // Increase index for next time
}

void flashTempSettingsErase(void){
  eraseFlashPages((uint32_t)&flashTempSettings, flashPages_TempSettings);
  flashTemp.tempIndex = 0;                                             // Reset index
  flashTemp.profileIndex = 0;
  for(uint8_t i=0; i<NUM_PROFILES;i++)
    flashTemp.tipIndex[i] = 0;

  flashTemp.temp=0xFFFF;
  flashTemp.profile=0xFF;
}

